In [63]:
import pandas as pd
import numpy as np
from numpy import NaN
import re

In [11]:
x=pd.Series([2.1,2.3,4.5,2.2,2.4])

median = np.median(x)
threshold = 2
outliers=[]
for item in x:
    if abs(item-median)>threshold:
        outliers.append(item)

print(outliers)

[4.5]

In [12]:
print(x.median())

2.3

In [16]:
mean = np.mean(x)
std = np.std(x)
outliers=[]
for item in x:
    if (item<mean-std) or (item>mean+std):
        outliers.append(item)
outliers

[4.5]

In [20]:
outliers=[]
for item in x:
    z_score = (item - mean) / std
    if z_score > 1.5:
        outliers.append(item)

outliers

[4.5]

In [33]:
Q1, Q3 = np.percentile(x,[25,75])
IQR = Q3 - Q1
outliers=[]
for item in x:
    if item < (Q1-1.5*IQR) or item > (Q3+ 1.5 * IQR):
        outliers.append(item)
outliers

[4.5]

In [34]:
print(x)

0    2.1
1    2.3
2    4.5
3    2.2
4    2.4
dtype: float64

In [36]:
print(Q3)

2.4

In [38]:
#MISSING DATA

SyntaxError: invalid syntax (3432814977.py, line 1)

In [40]:
data1 = { 'Name':['Edison','Edward','James','Neesham'],'Age':[28,27,NaN,36]}

In [41]:
data=pd.DataFrame(data1)
data

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James   NaN
3  Neesham  36.0

In [43]:
data.isnull().sum()

Name    0
Age     1
dtype: int64

In [46]:
data.dropna(inplace= True)
data

      Name   Age
0   Edison  28.0
1   Edward  27.0
3  Neesham  36.0

In [55]:
data=pd.DataFrame.from_dict(data1)
data

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James   NaN
3  Neesham  36.0

In [57]:
data.fillna(data.mean(numeric_only=True), inplace=True)
data

      Name        Age
0   Edison  28.000000
1   Edward  27.000000
2    James  30.333333
3  Neesham  36.000000

In [59]:
data=pd.DataFrame.from_dict(data1)

In [ ]:
mode()  NAJCZESNIEJ POJAWIAJACA SIE WARTOSC

In [60]:
data['Age'].mode()

0    27.0
1    28.0
2    36.0
Name: Age, dtype: float64

In [62]:
data['Age'].fillna(data['Age'].mode()[0], inplace =True)
data

      Name   Age
0   Edison  28.0
1   Edward  27.0
2    James  27.0
3  Neesham  36.0

In [65]:
txt = 'Python is my favorite programming language. I Love Python.'
x = re.findall('Python',txt)
x

['Python', 'Python']

In [67]:
print(len(x))

2

In [68]:
re.findall('^Python', txt)

['Python']

In [75]:
txt2 = 'Python  was 69 relased in 1991.'
re.findall('\d',txt2)

['6', '9', '1', '9', '9', '1']

In [74]:
re.findall('\d++',txt2)

['1991']

In [76]:
txtList=['Pakistan','Indonesia','Jordan', 'Pakistan']
txt=pd.Series(txtList)
txt

0     Pakistan
1    Indonesia
2       Jordan
3     Pakistan
dtype: object

In [77]:
re.findall('Pakistan', txt.to_string())

['Pakistan', 'Pakistan']

In [80]:
txt='Hello World hehe World'
match_object= re.search('World', txt)
match_object

In [83]:
txt3='C is my favorite programming language.'
re.sub(pattern='C', repl='Python', string = txt3)

'Python is my favorite programming language.'

In [ ]:
FEATURE SCALLING

In [86]:
df1 = {'Age':[28,27,30,36,27],'Salary':[10000,15000,11000,11000,13000]}

In [87]:
df = pd.DataFrame(df1)
df

   Age  Salary
0   28   10000
1   27   15000
2   30   11000
3   36   11000
4   27   13000

In [88]:
df =  (df-df.min()) / (df.max()-df.min())

In [89]:
df

        Age  Salary
0  0.111111     0.0
1  0.000000     1.0
2  0.333333     0.2
3  1.000000     0.2
4  0.000000     0.6

In [91]:
df = (df-df.mean()) / df.std()

In [93]:
df

        Age  Salary
0 -0.423109    -1.0
1 -0.687552     1.5
2  0.105777    -0.5
3  1.692435    -0.5
4 -0.687552     0.5